package lesson04;

public class Exer1 {
	public static void main(String[] args) {
		//1.모두의 마블
		//주사위 두개를 굴려서 이동한 거리를 계산 /랜덤사용
		//더블일 경우 한번 더 굴린다. 총 이동 거리를 출력
		
		
		//2.두 숫자를 입력받아 (정수) 두 숫자 사이의 정수의 합
		//ex) 3, 10 : 3++4+5+6+7+8+9+10 // 10,3   //사이의 합부터
		
		//3.자연수 두개 입력, 최대 공약수 구하기
		//12 18 >>6 //약수부터구하기//
		//12:1,2,3,4,6,12
		//18:1,2,3,6,9,18
		//두 수의 공약수는 1,2,3,6 (공통약수)중 제일 큰건:6
		
		
		//4. 소수 여부 확인
		//소수의 조건 :약수가 1과 자신만 존재(자기보다 작은수)
		//ex )10 소수가 아닙니다.
		//3,5는 소수로 나와야함
		
		//5.회문수 여부 구하기 /역순으로 돌려도같은숫자
		// 123321 :회문수 , 12345:회문수 아님
		
		
	}
}
